Revit 2027 API
InitialFluxIntensity(Double) Constructor
 Creates an initial flux intensity object with the given document and flux values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialFluxIntensity(
	double flux
)
Public Sub New (
	flux As Double
)
public:
InitialFluxIntensity(
	double flux
)
new :
        flux : float -> InitialFluxIntensity
Parameters
flux Double
 The flux value in lm as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The flux intensity value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialFluxIntensity Class
InitialFluxIntensity Overload
Autodesk.Revit.DB.Lighting Namespace